1+2

987-321
30*12
123/45
2^10
4*(3^2-1)-4^3/2

pi
sqrt(2)
sin(pi/2)
cos(pi/3)

x <- 2 #代入は<-で
x #確認

y = sqrt(2) #別に=でもよい
y #確認

y/x #変数で演算も可能

(xplus8 <- x+8) #カッコで挟んで代入すると結果も見れる

#練習問題
#(1)
9+(87/6-54/3)*2-1
#(2)
100^(1/2) #sqrt(100)でも可
#(3)
tan(pi/3) 
#(4)
3^(1/3)
#(5)
log10(2)
#(6)
(z <- exp(1))

#c()関数で数値をベクトル表現
(hikone <- c(3.9, 4.8, 7.9, 13.6, 19.3, 21.6, 26.2,
             27.4, 22.1, 17.2, 13.4, 8.6))

#平均値
mean(hikone)
#総和
sum(hikone)
#最大値
max(hikone)
#最小値
min(hikone)

#ベクトルの要素を取り出す
#変数[位置]
hikone[5] #彦根の5月の気温
hikone[c(1,6,12)] #1月，6月，12月

# 1つずつ増加するベクトルの生成
# 最初:(コロン)最後
1:12

# 同じ数字が並んだベクトルの生成
# rep(数字，個数)
rep(1, 10)

# 練習問題
# (1)
tokyo <- c(5.8, 5.7, 10.3, 14.5, 21.1, 22.1, 26.2, 26.7,
           22.6, 18.4, 13.9, 9.3)
# (2)
tokyo[c(2, 8)]
# (3)
mean(tokyo) #年平均気温
# (4)
tokyo-hikone #東京と彦根の月別気温差
# [1]や[12]は表示された出力結果の各行の先頭が1番目と12番目であることを意味している
# (5)
plot(tokyo)

# それまで自分で定義した変数を確認できる
ls()

# 行列の作成
# matrix(ベクトル，行数，列数)
matrix(1:10, nrow=2, ncol=5)
# 列もしくは行を指定しておけば省略可
matrix(1:10, nrow=2)
# 行列を横方向に埋めたい時はbyrow=T
matrix(1:10, nrow=2, byrow=T)

# 行列の演算例
# (1)
A <- matrix(c(1,2,3,5), nrow=2)
A
B <- matrix(c(2, -1, -3, 1), nrow=2)
B
A%*%B # A*B
# (2)
det(A) # Aの行列式
# (3)
solve(A) # Aの逆行列

(X <- matrix(1:12, nrow=3))
X[2, 3] # 2行，3列目の成分を抽出
X[2,] # 2行の成分を抽出
X[,3] # 3列の成分を抽出

# 練習問題
(A <- matrix(c(2,1,1,2,3,2,1,1,2), nrow=3))
# (1)
t(A) # Aの転置行列
# (2)
det(A) # Aの行列式
# (3)
solve(A) # Aの逆行列
# (4)
eigen(A) # Aの固有値

# help()によりデータや関数の説明を表示できる
help( mean )
