# 前回の復習問題
#1-(1)
4^3-1
#1-(2)
sqrt(5)
#1-(3)
cos(3*pi/4)
#2
test5 <- c(75, 50, 90, 85, 60)
mean(test5)
#3
(A <- matrix(0:3, nrow=2))
solve(A)

3:10　#3から10まで1ずつ増加する数列
10:3　#逆にすると減る

# 等差数列を作成　seq(初項，ここまで，by=項差)
seq(1, 20, by=3)　#20以下の1から3ずつ増える数列
seq(20, 4, by=-2)　#4以上の20から2ずつ減る数列

# 同じ数字を任意の個数並べる　rep(数字，個数)
rep(5, 12) #5を12個並べる

# ベクトル名[（位置）]で位置指定した要素が取り出せる
a <- c(7, 5, -2, -3, 4, 1) #ベクトルa作成
a[2]　#aの2番目の要素を抽出
a[c(1, 3, 4)] #aの1，3，4番目の要素を抽出

# ベクトル名[（条件）]で条件を満たす要素が取り出せる
a[a<=1] #aのうち1以下の要素を抽出

# ベクトル名[（位置）]　<- 数値で（位置）の数値を置換
a[3] <- 2 #aの3番目を2に置換
a  #確認
a[c(1, 5)] <- c(0, 9)　#1番目を0，5番目を9に
a  #確認
a[a>=5] <- 10 #aの5以上の要素を10に
a  #確認

#ベクトル名[-（位置）]で（位置）のデータを除く
a[-2] #aの2番目（10）を除く

#ベクトルの演算
#ベクトル同士の演算
x <- c(1,3,5,7,9); y <- c(5,4,3,2,1)
x+y
x-y
x*y
#ベクトルと数の演算
x-5 #すべての要素から5引く
2*y #すべての要素を2倍

# ベクトルに数学関数を適応
z <- c(1,2,4,8)
sqrt(z)
log(z)

#ベクトル用の関数
length(z)　#ベクトルの長さ（要素数）を求める

#練習問題
#(1)
x1 <- seq(5, 200, by=7)
#(2)
length(x1)
#(3)
x1[x1 >= 130]
#(4)
sum(c(1:10)^2)

data() #Rのデータ一覧を表示
sleep
# head(データ名，行数)
head(cars, 5)
example(cars)

library()
library(MASS)

install.packages("car")
library(car)

head(Davis, 5)
sleep$extra
sleep[,1]

getwd() #作業ディレクトリの確認
setwd("/Users/mikio/Desktop/その他/滋賀大学")
getwd()

